<?xml version="1.0" encoding="utf-8"?>
<Root>
  <Post Id="f1d442d5-05e0-4d8c-a7e8-f9ea95c7f9a0" Published="true" EnableComment="false" DatePublished="2012-09-29T19:38:26.9227501-03:00" DateCreated="2012-09-29T18:57:21.6457443-03:00">
    <Title>Apresentação sobte Domain Driven Design na reunião do GUMA-RS</Title>
    <TitleUrl>apresentacao-sobte-domain-driven-design-na-reuniao-do-guma-rs</TitleUrl>
    <Content>&lt;p&gt;&lt;img style="float: left;" src="/App_Resources/Images/09-29-2012_20-57-07_ddd.jpg" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;Ol&amp;aacute; senhoras e senhores,&lt;br /&gt;realizei uma palestra sobre Domain Dirven Design (DDD), na reuni&amp;atilde;o sobre arquitetura e desenvolvimento &amp;aacute;gil, no Grupo de Usu&amp;aacute;rios de Metodologias &amp;Aacute;geis do RS/Brasill (GUMA-RS). &lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;Antes de falar sobre &lt;span style="font-size: medium;"&gt;Domain Dirven Design&lt;/span&gt;, falei por que usamos DDD.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;Fa&amp;ccedil;o parte de uma das equipes que &amp;eacute; pioneira em metodologias &amp;aacute;geis no Terra Network. Usamos o SCRUM para fazer a gest&amp;atilde;o dos nossos projetos. Definimos e priorizamos junto com o cliente o que vai ser feito dentro de cada Sprint. Procuramos trabalhar com tarefas pequenas. Definimos as complexidades das User Stories e quando uma &lt;span style="font-size: medium;"&gt;User Stor&lt;/span&gt;y &amp;eacute; um entreg&amp;aacute;vel.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;Porem, n&amp;atilde;o est&amp;aacute;vamos trabalhando com "agilidade" na engenharia de software. Quando voc&amp;ecirc; trabalha com desenvolvimento interativo e incremental, onde a colabora&amp;ccedil;&amp;atilde;o entre cliente e equipe de desenvolvimento &amp;eacute; continua, &amp;eacute; necess&amp;aacute;rio responder r&amp;aacute;pido as mudan&amp;ccedil;as de escopo, garantir a qualidade e uma arquitetura da aplica&amp;ccedil;&amp;atilde;o emergente. Mas como voc&amp;ecirc; consegue isso quando existem paradigmas de elaborar arquiteturas engessadas, que prev&amp;ecirc;em o futuro e que se preocupa com complexidades desnecess&amp;aacute;rias. Sem falar em d&amp;eacute;bitos tecnicos entregue em cada intera&amp;ccedil;&amp;atilde;o :(&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;Ent&amp;atilde;o, buscamos algumas praticas &amp;aacute;geis (DDD, TDD e Integra&amp;ccedil;&amp;atilde;o Continua) que ajudaram e ajudam a continuar respondendo r&amp;aacute;pido as mudan&amp;ccedil;as, garantindo a qualidade no c&amp;oacute;digo e na constru&amp;ccedil;&amp;atilde;o de uma arquitetura sustent&amp;aacute;vel de manuten&amp;ccedil;&amp;atilde;o e evolu&amp;ccedil;&amp;atilde;o.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;&lt;span style="font-size: large;"&gt;Domain Drive Design&lt;/span&gt;, na minha percep&amp;ccedil;&amp;atilde;o, n&amp;atilde;o &amp;eacute; nada novo e sim uma compila&amp;ccedil;&amp;atilde;o de varias id&amp;eacute;ias da Engenharia de Software que o Eric Evans construiu neste livro.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;img style="float: left;" src="/App_Resources/Images/09-29-2012_22-15-23_livro-ddd.jpg" alt="" /&gt;&lt;span style="font-size: medium;"&gt; Essas pr&amp;aacute;ticas nos remetem a construir um projeto com o foco principal no dom&amp;iacute;nio e na l&amp;oacute;gica deste (id&amp;eacute;ias, comportamentos) e n&amp;atilde;o no banco de dados.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&lt;span style="font-size: medium;"&gt;&lt;span style="font-size: large;"&gt;Mas como representar/expressar um dom&amp;iacute;nio?&lt;/span&gt; &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;Bem, dom&amp;iacute;nios devem ser representados por modelos. Modelos n&amp;atilde;o s&amp;atilde;o UML. Um modelo &amp;eacute; um conjunto de objetos que, de forma abstrata, descrevem aspectos do dom&amp;iacute;nio.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;Um exemplo de modelo &amp;eacute; um Mapa-m&amp;uacute;ndi, onde temos objetos que representam &amp;aacute;reas e divis&amp;otilde;es. A imagem abaixo &amp;eacute; um mapa &amp;eacute; do s&amp;eacute;culo 18 para os chineses daquela &amp;eacute;poca. No centro temos a China com suas &amp;aacute;reas e divis&amp;otilde;es e nas bordas est&amp;atilde;o os "n&amp;atilde;o-chineses". O resto do mundo n&amp;atilde;o os interessava naquele momento para os chineses. &lt;br /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;img style="float: left;" src="/App_Resources/Images/09-29-2012_22-19-02_seculo-18.jpg" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;Para um sistema de software, um modelo pode ser um diagrama de classes, mas n&amp;atilde;o deve ficar restrito a isso. Se for necess&amp;aacute;rio para deixar claro o objetivo do modelo, podem ser adicionados fluxogramas, anota&amp;ccedil;&amp;otilde;es textuais, ou at&amp;eacute; uma nota&amp;ccedil;&amp;atilde;o que n&amp;atilde;o &amp;eacute; padr&amp;atilde;o de projeto, desde que quem entre em contato com o modelo entenda o que est&amp;aacute; vendo.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;Um modelo dever ser criado pela a equipe juntamente com o especialista de dom&amp;iacute;nio (cliente). Ou&amp;ccedil;a do especialista, pois &amp;eacute; ele que conhece o dom&amp;iacute;nio a equipe de desenvolvimento sabe sobre implementa&amp;ccedil;&amp;atilde;o e tecnologia, com o tempo ela vai aprendendo sobre o dom&amp;iacute;nio. &lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;Um paradigma que conseguimos quebra foi a do arquiteto, projetista ou analista. Quem tem que conhecer o dom&amp;iacute;nio &amp;eacute; a equipe de desenvolvimento. E o conhecimento sobre este modelo esta com todos e n&amp;atilde;o com o arquiteto, projetista ou analista. Mas isso n&amp;atilde;o quer dizer que voc&amp;ecirc; n&amp;atilde;o possa ter estes pap&amp;eacute;is, claro que pode desde que eles codifiquem e definem o modelo com todos. &lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;Em nossa equipe n&amp;atilde;o temos arquitetos ou projetista, o que temos &amp;eacute; um time multidisciplinar onde todos conseguem, em fun&amp;ccedil;&amp;atilde;o do dom&amp;iacute;nio, definir a arquitetura, projetar o software na intera&amp;ccedil;&amp;atilde;o, testar e codificar.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;&lt;strong&gt;&lt;span style="font-size: large;"&gt;Como ligar o modelo a implementa&amp;ccedil;&amp;atilde;o? &lt;/span&gt;&lt;/strong&gt;OOP e outras cositas mas!!&lt;/span&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;span style="font-size: medium;"&gt;&lt;span style="font-size: large;"&gt;&lt;strong&gt;Linguagem Onipresente (Ub&amp;iacute;qua)&lt;/strong&gt;&lt;/span&gt; &amp;ndash; Palavras escritas ou faladas pelo time do projeto devem se basear no linguajar do especialista do dom&amp;iacute;nio. O time de desenvolvimento n&amp;atilde;o falam a linguagem t&amp;eacute;cnica eles falam a linguagem do especialista de dom&amp;iacute;nio; &lt;/span&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img style="display: block; margin-left: auto; margin-right: auto;" src="/App_Resources/Images/09-29-2012_22-23-19_linguagem-ubiqua.png" alt="" width="297" height="200" /&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;span style="font-size: medium;"&gt;&lt;strong&gt;&lt;span style="font-size: large;"&gt;&lt;span style="font-size: medium;"&gt;Entidades -&lt;/span&gt; &lt;/span&gt;&lt;/strong&gt;S&amp;atilde;o objetos que possuem identidade no dom&amp;iacute;nio e representam as os conceitos abstratidos;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: medium;"&gt;&lt;span style="font-size: large;"&gt;&lt;strong&gt;Objetos de Valor&lt;/strong&gt;&lt;/span&gt; - N&amp;atilde;o possuim identidade para o dom&amp;iacute;nio, suas propriedades o identificam e s&amp;atilde;o imut&amp;aacute;veis. As cores s&amp;atilde;o exemplos de objetos de valor. Quando voc&amp;ecirc; quer trocar a cor de um l&amp;aacute;pis voc&amp;ecirc; n&amp;atilde;o toca o grafite dele voc&amp;ecirc; pega um novo l&amp;aacute;pis da cor que voc&amp;ecirc; que;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: medium;"&gt;&lt;span style="font-size: large;"&gt;&lt;strong&gt;Agrega&amp;ccedil;&amp;otilde;es&lt;/strong&gt; &lt;/span&gt;- Um grupo de objetos que devem ser tratados como um s&amp;oacute;, cujo agrupamento representa uma unidade maior no contexto do dom&amp;iacute;nio. Muitas vezes um objeto filho n&amp;atilde;o tem o menor sentido sem o seu "pai". O exemplo mais claro &amp;eacute; o relacionamento de um Item de Pedido com um Pedido. Os itens s&amp;oacute; existem em raz&amp;atilde;o do pedido, pois sem pedido n&amp;atilde;o &amp;eacute; poss&amp;iacute;vel ter qualquer item;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: medium;"&gt;&lt;span style="font-size: large;"&gt;&lt;strong&gt;Servi&amp;ccedil;os de dom&amp;iacute;nio&lt;/strong&gt;&lt;/span&gt; - Opera&amp;ccedil;&amp;otilde;es importantes que n&amp;atilde;o se encaixam em entidades e objetos de valores ou necessidade de trabalhar com mais de uma entidade;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: medium;"&gt;&lt;span style="font-size: large;"&gt;&lt;strong&gt;Reposit&amp;oacute;rios&lt;/strong&gt; &lt;/span&gt;- Guardam/recuperam os objetos (entidades) e n&amp;atilde;o possuem regas de neg&amp;oacute;cio.&lt;/span&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;Este &amp;eacute; um resumo sobre DDD, abaixo a apresenta&amp;ccedil;&amp;atilde;o. &lt;br /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p style="text-align: center;"&gt;&lt;iframe style="border: 1px solid #CCC; border-width: 1px 1px 0; margin-bottom: 5px;" src="http://www.slideshare.net/slideshow/embed_code/14518760" frameborder="0" marginwidth="0" marginheight="0" scrolling="no" width="427" height="356"&gt;&lt;/iframe&gt;&lt;/p&gt;
&lt;div style="margin-bottom: 5px; text-align: center;"&gt;&lt;strong&gt; &lt;a title="DDD &amp;ndash; Domain Driven Design" href="http://www.slideshare.net/jonatassaraiva3/guma-ddd-domain-driven-design" target="_blank"&gt;DDD &amp;ndash; Domain Driven Design &lt;/a&gt;- &lt;/strong&gt;&lt;strong&gt;&lt;a href="http://www.slideshare.net/jonatassaraiva3" target="_blank"&gt;Jonatas Saraiva&lt;/a&gt;&lt;/strong&gt;&lt;/div&gt;
&lt;p&gt;&lt;span style="font-size: medium;"&gt;Espero que este post ajude sobre o assunto :)&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;</Content>
    <Tags>
      <Tag>Ágil</Tag>
      <Tag>DDD</Tag>
    </Tags>
    <Comments />
  </Post>
</Root>